Autodesk.Revit.DB.ExternallyTaggedGeometryValidation.LacksSubnodes(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Makes sure that the input geometry object does not have sub-nodes.
geometry:
Geometry object to be validated.
Returns:
True if the supplied geometry object does not have sub-nodes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExternallyTaggedGeometryValidation.LacksSubnodes(Autodesk.Revit.DB.GeometryObject)
Makes sure that the input geometry object does not have sub-nodes.
geometry:
Geometry object to be validated.
Returns:
True if the supplied geometry object does not have sub-nodes.
Since:
2022

Autodesk.Revit.DB.ExternallyTaggedGeometryValidation.IsNonSolid(Autodesk.Revit.DB.GeometryObject)
Makes sure that the input geometry object is not a Solid.
Remarks:
This validation is different than negating IsSolid().
geometry:
Geometry object to be validated.
Returns:
True if the supplied geometry object is not a Solid.
Since:
2022

Autodesk.Revit.DB.ExternallyTaggedGeometryValidation.IsSolid(Autodesk.Revit.DB.GeometryObject)
Makes sure that the input geometry object is a Solid.
Remarks:
This validation is different than negating IsNonSolid().
geometry:
Geometry object to be validated.
Returns:
True if the supplied geometry object is a Solid.
Since:
2022

Autodesk.Revit.DB.ExternallyTaggedGeometryValidation.IsValidGeometry(Autodesk.Revit.DB.GeometryObject)
Validates the input geometry to be stored in an externally tagged geometry object.
Valid types of geometry are: Solid, Mesh, GeometryInstance, Point and Curve.
geometry:
Geometry object to be validated.
Returns:
True if the supplied geometry object passes the validation criteria.
Since:
2022

Autodesk.Revit.DB.ExternallyTaggedGeometryValidation
Provides validation for geometry to be stored in an ExternallyTaggedGeometry.
Since:
2022